import random as r

signs_numbers = ['АА', 'АВ', 'АЕ', 'АІ', 'АК', 'АМ', 'АН', 'АО', 'АР', 'АС', 'АТ', 'АХ', 'АВ', 'ВА', 'ВВ', 'ВС', 'ВЕ', 'ВІ', 'ВК', 'ВМ', 'ВН']
address = ["вул. Шевченка, 12, Київ, Україна", "просп. Незалежності, 45, Львів, Україна", "вул. Лесі Українки, 8, Харків, Україна", "вул. Франка, 23, Одеса, Україна", "просп. Свободи, 67, Дніпро, Україна", "вул. Гоголя, 14, Запоріжжя, Україна", "вул. Коцюбинського, 9, Чернігів, Україна", "вул. Володимирська, 21, Київ, Україна", "вул. Садова, 34, Вінниця, Україна", "вул. Миру, 18, Полтава, Україна", "вул. Гагаріна, 27, Хмельницький, Україна", "просп. Центральний, 5, Черкаси, Україна", "вул. Перемоги, 16, Суми, Україна", "вул. Шевченка, 44, Рівне, Україна", "вул. Дніпровська, 11, Дніпро, Україна", "вул. Молодіжна, 3, Івано-Франківськ, Україна", "вул. Соборна, 29, Луцьк, Україна", "просп. Гагаріна, 12, Миколаїв, Україна", "вул. Пушкіна, 6, Чернівці, Україна", "вул. Козацька, 22, Херсон, Україна", "вул. Лермонтова, 7, Львів, Україна"]
surname = ["Коваль", "Петренко", "Шевченко", "Мороз", "Бондаренко", "Кузнєцова", "Тимошенко", "Грищенко", "Литвин", "Савченко", "Романенко", "Мельник", "Федоренко", "Харченко", "Яковенко", "Бойко", "Кравець", "Даниленко", "Сокол", "Панасюк", "Голуб"]

# for i in range(1,22):
#     print(f'(\'{i}\',\'\',\'{signs_numbers[random.randint(0,20)]}_{random.randint(100000,999999)}\')',end=',\n')
# for i in range(1,22):
#     print(f'UPDATE dbo.Klient\nSET Депозит = \'{random.randint(10,99999)}$\'\nWHERE ID = {i};')
for i in range(1,22):
    print(f'UPDATE dbo.Klient\nSET Прізвище = \'{surname[i-1]}\'\nWHERE ID = {i};')