#variant 6
import numpy as np

# Створити матрицю 4х4 з заданим типом елементів і значеннями та вивести інформацію
# про матрицю (розмірність, тип елементів, розмір елементу масиву в байтах, розмір масиву
# в байтах) та саму матрицю:

# 2. Тип: uint64, всі 3 – в першому рядку, всі 2 – в другому рядку і т. д.
# a = np.array([[3]*4,
#               [2]*4,
#               [1]*4,
#               [0]*4], dtype='uint64')
a = np.array([
    [1,2,3,4],
    [5,6,7,8],
    [9,10,11,12],
    [13,14,15,16]
])
print('Матриця 4х4 із елементами за умовою: ')
print(a)
# print(f'Розмірність матриці: {a.shape} (рядки, стовпці)')
# print(f'Тип даних матриці: {a.dtype}')
# print(f'Розмір матриці: {a.size} байтів')

# Вивести з допомогою операцій індексації, зміни розмірностей та зрізів:

# 13. Непарні стовпці.
print('Непарні стовпці:')
print(a[:,0::2])

# 15. Кожен третій рядок.
print('Кожен третій рядок:')
print(a[2::3,:])
# for i in range(a.shape[0]):
#     if (i+1)%3 == 0:
#         print(a[i])

# 18. Елементи в непарних стовпцях у непарних рядках.
print('Елементи в непарних стовпцях у непарних рядках:')
print(a[0::2,0::2])
# for i in range(a.shape[0]):
#     for j in range(a.shape[0]):
#         if (j+1)%2 == 1 and (i+1)%2 == 1:
#             print(a[i,j])

# 21. Елементи в парних рядках менші за 2.
print('Елементи в парних рядках менші за 2:')
print(a[1::2]<2)
# for i in range(a.shape[0]):
#     for j in range(a.shape[0]):
#         if (i+1)%2 == 0 and a[i,j] < 2:
#             print(a[i,j]) 
# 35. Реверсувати порядок елементів у стовпцях.

print('Реверсувати порядок елементів у стовпцях:')
print(a[::-1,:])
# 46. Підрахувати кількість непарних елементів у матриці.
print('Кількість непарних елементів у матриці:')
odd= 0
for i in range(a.shape[0]):
    for j in range(a.shape[0]):
        if a[i,j]%2 == 1:
            odd +=1
print(odd)
# Знайти і вивести для матриці:

# 50. Максимальні значення по стовпцях.
print('Максимальні значення по стовпцях:')
for j in range(a.shape[0]):
    print(a[:,j].max(), end=', ')

# 55. Середнє значення.
print('\nСереднє значення матриці: ')
print(a.sum()/a.size)

# 63. Розв’язати задану систему лінійних рівнянь і показати, що розв’язок вірний:
# [2   3   7][x1]   [ -2 ]
# [11  4   9][x2] = [ 13 ]
# [17  1  -3][x3]   [ 6  ]

array_coefficients = np.array([
    [2,3,7],
    [11,4,9],
    [17,1,-3],
])
array_constants = np.array([-2,13,6])
solution = np.linalg.solve(array_coefficients,array_constants)
print(f"""Розв'язок системи лінійних рівнянь 
      [2x1 +  3x2 +  7x3 = -2
      [11x1 + 4x2 + 9x3 =  13
      [17x1 + x2 + -3x3 =  6 
      
      (x1, x2, x3 відповідно): {solution}""")
print('Доведення правильності розв\'язку')
print(int(2*solution[0] + 3*solution[1] + 7*solution[2]))
print(int(11*solution[0] + 4*solution[1] + 9*solution[2]))
print(int(17*solution[0] + 1*solution[1] + -3*solution[2]))